---
kind: property
id: P:Autodesk.Revit.DB.SaveAsOptions.Compact
source: html/8033852c-97a3-06c7-fb4d-0d91c5741e62.htm
---
# Autodesk.Revit.DB.SaveAsOptions.Compact Property

Default is false: let the OS eliminate as much or as little dead data as it wants to.
 True: force the OS to eliminate all dead data from the file on disk.

## Syntax (C#)
```csharp
public bool Compact { get; set; }
```